<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 日志记录方式，内置 file socket 支持扩展
   
        // 验证码字符集合
        'codeSet'  => '1234567890',  // abcdefhijkmnpqrstuvwxyzABCDEFGHJKLMNPQRTUVWXY
        // 验证码字体大小(px)
        'fontSize' => 16,
        // 是否画混淆曲线
        'useCurve' => false,
        // 验证码图片高度
        'imageH'   => 38,
        // 验证码图片宽度
        'imageW'   => 135,
        // 验证码位数
        'length'   => 4,
        // 验证成功后是否重置
        'reset'    => true,
    
];
