<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 模板设置
// +----------------------------------------------------------------------

return [
    // 模板引擎类型 支持 php think 支持扩展
    'type'         => 'Think',
    // 默认模板渲染规则 1 解析为小写+下划线 2 全部转换小写 3 保持操作方法
    'auto_rule'    => 1,
    // 模板路径
    'view_path'    => '',
    // 模板后缀
    'view_suffix'  => 'html',
    // 模板文件名分隔符
    'view_depr'    => DIRECTORY_SEPARATOR,
    // 模板引擎普通标签开始标记
    'tpl_begin'    => '{',
    // 模板引擎普通标签结束标记
    'tpl_end'      => '}',
    // 标签库标签开始标记
    'taglib_begin' => '{',
    // 标签库标签结束标记
    'taglib_end'   => '}',
     // 模板路径替换
     'tpl_replace_string'  =>  [
      '__AC__'        => 'admin/css',
        // 后台模板js文件夹
        '__AJ__'        => 'admin/js',
        // 后台模板image文件夹
        '__AI__'        => 'admin/image',
        // 后台模板frame文件夹
        '__AF__'        => 'admin/frame',
        // 前台模板css文件夹
        '__IC__'        => 'index/css',
        // 前台模板js文件夹
        '__IJ__'        => 'index/js',
        // 前台模板image文件夹
        '__II__'        => 'index/img',
        // 前台模板frame文件夹
        '__IF__'        => 'index/frame',
        // 上传文件夹
        '__UPLOAD__'    => '/uploads',
         '__STATIC__'=>'/static'
    ],
];
